# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [1]:
import pandas as pd
import numpy as np
# from random import randint
# np.random.seed(101)

In [2]:
from numpy.random import randint
np.random.seed(101)

In [8]:
arr = randint(10,200,20)

In [11]:
arr

array([146, 125, 167, 125,  69, 172,  54,  82,  29, 136, 148,  86, 117,
        97, 138, 115,  18,  72, 174, 109])

In [12]:
arr = arr.reshape(5,4)

In [13]:
arr

array([[146, 125, 167, 125],
       [ 69, 172,  54,  82],
       [ 29, 136, 148,  86],
       [117,  97, 138, 115],
       [ 18,  72, 174, 109]])

In [32]:
df = pd.DataFrame(arr,index=['A', 'B', 'C', 'D','E'],columns=['W', 'X' ,'Y' ,'Z'])

In [33]:
df

     W    X    Y    Z
A  146  125  167  125
B   69  172   54   82
C   29  136  148   86
D  117   97  138  115
E   18   72  174  109

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [16]:
df['W']

A    146
B     69
C     29
D    117
E     18
Name: W, dtype: int32

In [18]:
# Pass a list of column names
df[['W','Z','Y']]

     W    Z    Y
A  146  125  167
B   69   82   54
C   29   86  148
D  117  115  138
E   18  109  174

In [20]:
# SQL Syntax (NOT RECOMMENDED!)
df.W

A    146
B     69
C     29
D    117
E     18
Name: W, dtype: int32

DataFrame Columns are just Series

In [19]:
type(df['W'])

pandas.core.series.Series

**Creating a new column:**

In [34]:
df['new'] = df['W'] + df['Y']

In [35]:
df

     W    X    Y    Z  new
A  146  125  167  125  313
B   69  172   54   82  123
C   29  136  148   86  177
D  117   97  138  115  255
E   18   72  174  109  192

In [22]:
df['newempty']= 0

** Removing Columns**

In [23]:
df

     W    X    Y    Z  new  newempty
A  146  125  167  125  313         0
B   69  172   54   82  123         0
C   29  136  148   86  177         0
D  117   97  138  115  255         0
E   18   72  174  109  192         0

In [26]:
df.drop('newempty',axis=1,inplace=True)

In [27]:
# Not inplace unless specified!
df

     W    X    Y    Z  new
A  146  125  167  125  313
B   69  172   54   82  123
C   29  136  148   86  177
D  117   97  138  115  255
E   18   72  174  109  192

In [31]:
df.drop('new',axis=1,inplace=True)

In [32]:
df['new'] = np.arange(0,5)

Can also drop rows this way:

In [36]:
df

     W    X    Y    Z  new
A  146  125  167  125    0
B   69  172   54   82    1
C   29  136  148   86    2
D  117   97  138  115    3

In [36]:
df.drop('E', axis=0, inplace=True)

** Selecting Rows**

In [37]:
df.loc['A']

W      146
X      125
Y      167
Z      125
new    313
Name: A, dtype: int32

Or select based off of position instead of label

In [38]:
df.iloc[0]

W      146
X      125
Y      167
Z      125
new    313
Name: A, dtype: int32

** Selecting subset of rows and columns **

In [39]:
df

     W    X    Y    Z  new
A  146  125  167  125  313
B   69  172   54   82  123
C   29  136  148   86  177
D  117   97  138  115  255

In [40]:
df.loc['D','new']

255

In [41]:
df.loc[['B','C'],['X','Y']]

     X    Y
B  172   54
C  136  148

In [43]:
df.iloc[[1,2],[1,2]]

     X    Y
B  172   54
C  136  148

In [87]:
df.loc[['C','E'],['W','X','Y','Z']]

     W    X    Y    Z
C  113  153   54   10
E  107  162  174  134

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [44]:
df

     W    X    Y    Z  new
A  146  125  167  125  313
B   69  172   54   82  123
C   29  136  148   86  177
D  117   97  138  115  255

In [45]:
df>100

       W      X      Y      Z   new
A   True   True   True   True  True
B  False   True  False  False  True
C  False   True   True  False  True
D   True  False   True   True  True

In [46]:
df[df>100]

       W      X      Y      Z  new
A  146.0  125.0  167.0  125.0  313
B    NaN  172.0    NaN    NaN  123
C    NaN  136.0  148.0    NaN  177
D  117.0    NaN  138.0  115.0  255

In [47]:
df[df['W']>100]

     W    X    Y    Z  new
A  146  125  167  125  313
D  117   97  138  115  255

In [48]:
df[df['W']>100]['Y']

A    167
D    138
Name: Y, dtype: int32

In [49]:
df[df['W']>100][['Y','X']]

     Y    X
A  167  125
D  138   97

For two conditions you can use | and & with parenthesis:

In [52]:
df[(df['W']>100) | (df['Y'] > 100)]

     W    X    Y    Z  new
A  146  125  167  125  313
C   29  136  148   86  177
D  117   97  138  115  255

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [53]:
df

     W    X    Y    Z  new
A  146  125  167  125  313
B   69  172   54   82  123
C   29  136  148   86  177
D  117   97  138  115  255

In [54]:
# Reset to default 0,1...n index
df.reset_index(inplace=True)

In [55]:
df

  index    W    X    Y    Z  new
0     A  146  125  167  125  313
1     B   69  172   54   82  123
2     C   29  136  148   86  177
3     D  117   97  138  115  255

In [56]:
df = df.drop('new', axis=1)

In [61]:
'CA NY WY CO'.split()

['CA', 'NY', 'WY', 'CO']

In [62]:
newind = 'CA NY WY CO'.split()

In [63]:
newind

['CA', 'NY', 'WY', 'CO']

In [64]:
df['States'] = newind

In [66]:
df

  index    W    X    Y    Z States
0     A  146  125  167  125     CA
1     B   69  172   54   82     NY
2     C   29  136  148   86     WY
3     D  117   97  138  115     CO

In [67]:
df = df.set_index('States')

In [68]:
df

       index    W    X    Y    Z
States
CA         A  146  125  167  125
NY         B   69  172   54   82
WY         C   29  136  148   86
CO         D  117   97  138  115

In [216]:
df.set_index('States',inplace=True)

In [218]:
df

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [69]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
# hier_index = pd.MultiIndex.from_tuples(hier_index)

In [42]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [72]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [74]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  1.589176  0.533221
   2  0.857349  0.087076
   3 -0.397462  1.261688
G2 1  0.433331 -0.136614
   2  0.882140 -0.377811
   3  0.146639  1.269122

Now let's show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

In [260]:
df.loc['G1']

          A         B
1  0.153661  0.167638
2 -0.765930  0.962299
3  0.902826 -0.537909

In [263]:
df.loc['G1'].loc[1]

A    0.153661
B    0.167638
Name: 1, dtype: float64

In [75]:
df.index.names

FrozenList([None, None])

In [76]:
df.index.names = ['Group','Num']

In [78]:
df

                  A         B
Group Num
G1    1    1.589176  0.533221
      2    0.857349  0.087076
      3   -0.397462  1.261688
G2    1    0.433331 -0.136614
      2    0.882140 -0.377811
      3    0.146639  1.269122

In [49]:
df.xs('G1')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [50]:
df.xs(['G1',1])

A    0.302665
B    1.693723
Name: (G1, 1), dtype: float64

In [51]:
df.xs(1,level='Num')

              A         B
Group
G1     0.302665  1.693723
G2     0.166905  0.184502

# Great Job!